semester-project-xaas/app/views/admin/index.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <% @orders.each do |order| %>
  <td><%= order.customer.first_name + " " + order.customer.last_name  %></td>