semester-project-xaas/app/views/orders/_form.html.erb

     <%= form.label :state %><br />
     <%= form.collection_select :state_id, State.all ,:id,  :state_name, selected: @customer.state_id %>
---
SELECT "states".* FROM "states"