semester-project-xaas/app/views/orders/show.html.erb

  <strong>Customer:</strong>
  <%= @order.customer.first_name + " " + @order.customer.last_name %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 ORDER BY "customers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  <strong>Order status:</strong>
  <%= @order.order_status.status %>
---
SELECT  "order_statuses".* FROM "order_statuses" WHERE "order_statuses"."status" = $1 LIMIT $2  [["status", "Placed"], ["LIMIT", 1]]

  </tr>
<% @order.order_contents.each do |content| %>
---
SELECT "order_contents".* FROM "order_contents" WHERE "order_contents"."order_id" = $1  [["order_id", 2]]