semester-project-xaas/app/controllers/admin_controller.rb

  def index
    # Post.paginate(:page => params[:page], :per_page => 30)
    @orders = Order.where(order_status: 1).paginate(:page => params[:page])
     @states_with_orders = Order.joins(:state).pluck(:state_id, :state_name).uniq #Get states that have an order
---
SELECT "orders"."state_id", "state_name" FROM "orders" INNER JOIN "states" ON "states"."id" = "orders"."state_id"