semester-project-xaas/app/controllers/admin_controller.rb

  def index
    # Post.paginate(:page => params[:page], :per_page => 30)
    @orders = Order.where(order_status: "Placed").paginate(:page => params[:page])
    @unavailable_inventory = Item.where(available: false)
     @item_popularity = OrderContent.select(:qty, :name).joins(:item).group(:name).sum(:qty)
     @item_popularity_state = OrderContent.joins(:item).joins(:order).joins(:state).group(:state_name, :name).sum(:qty)
     @states_with_orders = Order.pluck(:state_id).uniq
     @states_with_orders.each do |state|
---
SELECT  "orders".* FROM "orders" WHERE "orders"."order_status_id" = 0 LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."order_status_id" = 0
SELECT  "order_contents"."qty", "name" FROM "order_contents" INNER JOIN "orders" ON "orders"."id" = "order_contents"."order_id" INNER JOIN "orders" "orders_order_contents_join" ON "orders_order_contents_join"."id" = "order_contents"."order_id" INNER JOIN "states" ON "states"."id" = "orders_order_contents_join"."state_id" ORDER BY "order_contents"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT SUM("order_contents"."qty") AS sum_qty, "name" AS name FROM "order_contents" INNER JOIN "orders" ON "orders"."id" = "order_contents"."order_id" GROUP BY "name"
SELECT  "order_contents".* FROM "order_contents" INNER JOIN "orders" ON "orders"."id" = "order_contents"."order_id" INNER JOIN "orders" "orders_order_contents_join" ON "orders_order_contents_join"."id" = "order_contents"."order_id" INNER JOIN "states" ON "states"."id" = "orders_order_contents_join"."state_id" ORDER BY "order_contents"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "orders".* FROM "orders" INNER JOIN "order_contents" ON "order_contents"."order_id" = "orders"."id" INNER JOIN "order_contents" "order_contents_orders_join" ON "order_contents_orders_join"."order_id" = "orders"."id" INNER JOIN "items" ON "items"."id" = "order_contents_orders_join"."item_id" WHERE "orders"."state_id" = $1 GROUP BY "qty", "orders"."id"  [["state_id", 44]]
SELECT SUM("order_contents"."qty") AS sum_qty, "state_name" AS state_name, "name" AS name FROM "order_contents" INNER JOIN "orders" ON "orders"."id" = "order_contents"."order_id" INNER JOIN "orders" "orders_order_contents_join" ON "orders_order_contents_join"."id" = "order_contents"."order_id" INNER JOIN "states" ON "states"."id" = "orders_order_contents_join"."state_id" INNER JOIN "items" ON "items"."id" = "order_contents"."item_id" GROUP BY "state_name", "name" ORDER BY "order_contents"."qty" ASC
SELECT SUM(order_contents.qty) AS sum_order_contents_qty, "name" AS name FROM "orders" INNER JOIN "states" ON "states"."id" = "orders"."state_id" INNER JOIN "order_contents" ON "order_contents"."order_id" = "orders"."id" INNER JOIN "order_contents" "order_contents_orders_join" ON "order_contents_orders_join"."order_id" = "orders"."id" INNER JOIN "items" ON "items"."id" = "order_contents_orders_join"."item_id" WHERE "orders"."state_name" = $1 GROUP BY "name"  [["state_name", 44]]
SELECT "orders"."state_id" FROM "orders" GROUP BY "orders"."state_id", "orders"."id"
SELECT SUM("orders"."state_id") AS sum_state_id, "orders"."state_id" AS orders_state_id, "orders"."id" AS orders_id FROM "orders" GROUP BY "orders"."state_id", "orders"."id"
SELECT "orders".* FROM "orders" WHERE "orders"."state_id" = $1  [["state_id", 44]]