semester-project-xaas/app/controllers/items_controller.rb

  def index
    @items = Item.where(available: :true)
---
SELECT "items".* FROM "items" WHERE "items"."available" = $1  [["available", "true"]]