semester-project-xaas/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = 4
---
  def index
    @orders = Order.where(customer: current_customer)

INSERT INTO "orders" ("total", "order_status_id", "created_at", "updated_at", "customer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["total", "150.0"], ["order_status_id", 1], ["created_at", "2017-10-24 21:37:54.054716"], ["updated_at", "2017-10-24 21:37:54.054716"], ["customer_id", 4]]
INSERT INTO "order_contents" ("order_id", "item_id", "qty", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 1], ["item_id", 2], ["qty", 1], ["created_at", "2017-10-28 22:22:24.727534"], ["updated_at", "2017-10-28 22:22:24.727534"]]
---
  def create
    token = params[:stripeToken]
    total = (get_cart_total*100).round
    charge = Stripe::Charge.create(
      :amount => total,
      :currency => "usd",
      :description => "Example charge",
      :source => token,
    )
    logger.warn(charge.outcome.network_status.include? "approved")
    logger.warn("stripe token::::: " + token)
    logger.warn(charge.id)
    if charge.outcome.network_status.include? "approved"
      @cart_items = get_cart_items
      @customer = current_customer
      @order = Order.create(customer: @customer, total: get_cart_total, stripe_key: charge.id)
      @cart_items.each do |cart_item|
      @order_contents = OrderContent.create(order_id: @order.id, item_id: cart_item[:item].id, qty: cart_item[:qty])